---
kind: property
id: P:Autodesk.Revit.DB.DeleteWorksetSettings.DeleteWorksetOption
source: html/087c5fa5-6b5d-19a6-e3bb-6ede5e7bbe22.htm
---
# Autodesk.Revit.DB.DeleteWorksetSettings.DeleteWorksetOption Property

The current delete workset option.

## Syntax (C#)
```csharp
public DeleteWorksetOption DeleteWorksetOption { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration